using System.Text;
using Microsoft.VisualStudio.TestTools.UnitTesting;
using WhetStone.Looping;
using WhetStone.WordPlay;

namespace Tests
{
    [TestClass]
    public class SecureEncryption
    {
        [TestMethod]
        public void Simple()
        {
            string[] strings =
            {
                "test", "plain", "askaskljsjdfbvdskjfgdksfdklschabcgfdhkasc",
                "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa",
                "עברית",
                "3.1415926535897932384626433832795028841971693993751058209749445923078164062862089986280348253421170679821480865132823066470938446095505822317253594081284811174502841027019385211055596446229489549303819644288109756659334461284756482337867831652712019091456485669234603486104543266482133936072602491412737245870066063155881748815209209628292540917153643678925903600113305305488204665213841469519415116094330572703657595919530921861173819326117931051185480744623799627495673518857527248912279381830119491298336733624406566430860213949463952247371907021798609437027705392171762931767523846748184676694051320005681271452635608277857713427577896091736371787214684409012249534301465495853710507922796892589235420199561121290219608640344181598136297747713099605187072113499999983729780499510597317328160963185950244594553469083026425223082533446850352619311881710100031378387528865875332083814206171776691473035982534904287554687311595628638823537875937519577818577805321712268066130019278766111959092164201989",
                "אָנֹכִי ה\' אֱלֹהֶיךָ אֲשֶׁר הוֹצֵאתִיךָ מֵאֶרֶץ מִצְרַיִם מִבֵּית עֲבָדִים.\r\n\r\nלֹא יִהְיֶה לְךָ אֱלֹהִים אֲחֵרִים עַל פָּנָי, לֹא תַעֲשֶׂה לְךָ פֶסֶל וְכָל תְּמוּנָה אֲשֶׁר בַּשָּׁמַיִם מִמַּעַל וַאֲשֶׁר בָּאָרֶץ מִתָּחַת וַאֲשֶׁר בַּמַּיִם מִתַּחַת לָאָרֶץ. לֹא תִשְׁתַּחֲוֶה לָהֶם וְלֹא תָעָבְדֵם, כִּי אָנֹכִי ה\' אֱלֹהֶיךָ אֵל קַנָּא, פֹּקֵד עֲוֹן אָבֹת עַל בָּנִים עַל שִׁלֵּשִׁים וְעַל רִבֵּעִים לְשׂנְאָי, וְעֹשֶׂה חֶסֶד לַאֲלָפִים לְאֹהֲבַי וּלְשֹׁמְרֵי מִצְוֹתָי.\r\n\r\nלֹא תִשָּׂא אֶת שֵׁם ה\' אֱלֹהֶיךָ לַשָּׁוְא, כִּי לֹא יְנַקֶּה ה\' אֵת אֲשֶׁר יִשָּׂא אֶת שְׁמוֹ לַשָּׁוְא.\r\n\r\nזָכוֹר אֶת יוֹם הַשַּׁבָּת לְקַדְּשׁוֹ. שֵׁשֶׁת יָמִים תַּעֲבֹד וְעָשִׂיתָ כָּל מְלַאכְתֶּךָ, וְיוֹם הַשְּׁבִיעִי שַׁבָּת לַה\' אֱלֹהֶיךָ. לֹא תַעֲשֶׂה כָל מְלָאכָה אַתָּה וּבִנְךָ וּבִתֶּךָ עַבְדְּךָ וַאֲמָתְךָ וּבְהֶמְתֶּךָ וְגֵרְךָ אֲשֶׁר בִּשְׁעָרֶיךָ. כִּי שֵׁשֶׁת יָמִים עָשָׂה ה\' אֶת הַשָּׁמַיִם וְאֶת הָאָרֶץ, אֶת הַיָּם וְאֶת כָּל אֲשֶׁר בָּם, וַיָּנַח בַּיּוֹם הַשְּׁבִיעִי, עַל כֵּן בֵּרַךְ ה\' אֶת יוֹם הַשַּׁבָּת וַיְקַדְּשֵׁהוּ.\r\n\r\nכַּבֵּד אֶת אָבִיךָ וְאֶת אִמֶּךָ לְמַעַן יַאֲרִכוּן יָמֶיךָ עַל הָאֲדָמָה אֲשֶׁר ה\' אֱלֹהֶיךָ נֹתֵן לָךְ.\r\nלֹא תִרְצַח.\r\n\r\nלֹא תִנְאָף.\r\n\r\nלֹא תִגְנֹב.\r\n\r\nלֹא תַעֲנֶה בְרֵעֲךָ עֵד שָׁקֶר.\r\n\r\nלֹא תַחְמֹד בֵּית רֵעֶךָ. לֹא תַחְמֹד אֵשֶׁת רֵעֶךָ וְעַבְדּוֹ וַאֲמָתוֹ וְשׁוֹרוֹ וַחֲמֹרוֹ וְכֹל אֲשֶׁר לְרֵעֶךָ.",
                "what if we hadd spe\0cial esc\aape charact\bers?",
                range.Range('\u0000','\uffff').ConvertToString()
            };
            foreach (var v in strings.Join(@join.CartesianType.AllPairs).SelectMany(a=>a.Enumerate(10)))
            {
                var plain = Encoding.Unicode.GetBytes(v.Item1);
                var key = Encoding.Unicode.GetBytes(v.Item2);
                var cipher = CipherStone.SecureEncryption.Encrypt(plain, key, plain.GetHashCode()%640);
                var deciphered = CipherStone.SecureEncryption.Decrypt(cipher, key);
                Assert.IsTrue(plain.SequenceEqual(deciphered));
            }
        }
    }
}
